Python 3.7.1 (v3.7.1:260ec2c36a, Oct 20 2018, 14:57:15) [MSC v.1915 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>>  #EXERCICIO_SEMANA_2


#QUESTÃO 01

print ("Hello, World!")
Hello, World!
>>> #soma
>>> 3+5
8
>>> 9+12
21
>>> 7+32
39
>>> #decimais
>>> 4.5 + 7.3
11.8
>>> 7.9 + 18.2
26.1
>>> 3.6 + 34.1
37.7
>>> #subtração
>>> 5-2
3
>>> 9-7
2
>>> 15-20
-5
>>> 45-74
-29
>>> #multiplicação
>>> 2 * 5
10
>>> 4 * 9
36
>>> 10 * 10
100
>>> 2 * 2 * 2
8
>>> #divisão
>>> 45 / 5
9.0
>>> 100 / 20
5.0
>>> 9 / 3
3.0
>>> 10 / 3
3.3333333333333335
>>> 2/0
Traceback (most recent call last):
  File "<pyshell#24>", line 1, in <module>
    2/0
ZeroDivisionError: division by zero
>>> #divisão_inteira
>>> 10 // 3
3
>>> 11 // 2
5
>>> 100 // 6
16
>>> #restodadivisão
>>> 10 % 2
0
>>> 15 % 4
3
>>> 100 % 6
4
>>> #potenciação/exponenciação
>>> 2 * 2 * 2 * 2 * 2 * 2 * 2 * 2 * 2 * 2
1024
>>> 2 ** 10
1024
>>> 10 ** 3
1000
>>> (10 ** 800 + 9 ** 1000) * 233
407254001651377825050774086265365912933271559572398924650169906751889900030955189004916347478470698880616885512201849445183728845558993514870858509087817789576388584560964682795896403435448681980001360244790530805842737419978616650940647045809688543958807077794866143976192872389017280782837244051514550016751431331392474612723898201318251801288569103581859710953756463227568553903785400053293756105145991925711692828410365978814157929143646138367222515290495329841814490874087309733954914817582614165290441834984054374534909954119315442169415884429645515258867781282214407424938115130906555866837546110340314133204645184212592152733050063403478054121909337278892530383627259086060904403894148963384111173869448637825223750221720739904084905206403076141255284819817001128530851921214720479861908207168928806625713775441834487646542035428141369478170696522098960677314242891140325390964310295889079588950798788612324634050495786532200848059999839607732520233
>>> #raizquadrada
>>> 4 ** 0.5
2.0
>>> import math
>>> math.sqrt(16)
4.0
>>> math.pi
3.141592653589793
>>> #expressõesNuméricas
>>> 3 + 4 * 2
11
>>> 7 + 3 * 6 - 4 ** 2
9
>>> (3 + 4) * 2
14
>>> (8 / 4) ** (5 - 2)
8.0
>>> #notaçãocientifca
>>> 10e6
10000000.0
>>> 1e6
1000000.0
>>> 1e - 5
SyntaxError: invalid syntax
>>> 1e-5
1e-05
>>> 1E6
1000000.0
>>> #comentarios
>>> 3 + 4 #será ldio apenas o calculo
7
>>> 2 < 10
True
>>> 2 > 11
False
>>> 10 > 10
False
>>> 10 >= 10
True
>>> 42 == 25
False
SyntaxError: multiple statements found while compiling a single statement
>>> 
>>> #QUESTÃO 2
>>> 10 % 13
10
>>> 10 % 3
1
>>> 13 * 1
13
>>> #QUESTÃO 3
>>> 13 * 1
13
>>> 13 * 2
26
>>> 13 * 3
39
>>> 13 * 4
52
>>> 13 * 5
65
>>> 13 * 6
78
>>> 13 * 7
91
>>> 13 * 8
104
>>> 13 * 9
117
>>> 13 * 10
130
>>> #QUESTÃO 4
>>> #total de semanas
>>> 4 * 4
16
>>> #total de aulas
>>> 2 * 16
32
>>> (75 / 100) * 32
24.0
>>> #aulas que pode faltar
>>> 32 - 24
8
>>> print ("Davinir pode faltar 8 aulas" )
Davinir pode faltar 8 aulas
>>> 
>>> #questão 5
>>> import math
>>> math.pi * 2 * 2
12.566370614359172
>>> #questão 6
>>> desl = 65 * 1000
>>> hr = 3 * 3600
>>> minu = 23 * 60
>>> seg = hr + minu + 17
>>> vel = desl / seg
>>> print("A velocidade média é:  ", s)
Traceback (most recent call last):
  File "<pyshell#36>", line 1, in <module>
    print("A velocidade média é:  ", s)
NameError: name 's' is not defined
>>> print("A velocidade média é:  ", vel)
A velocidade média é:   5.329179306386816
>>> print("A velocidade média é:  ", vel ,"m/s")
A velocidade média é:   5.329179306386816 m/s
>>> 
